<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Конфиг хранит настройки подключения и имена очередей.
    | Приложение берет отсюда параметры для соединения с RabbitMQ.
    |--------------------------------------------------------------------------
    */

    'default' => env('RABBITMQ_QUEUE', 'laravel_queue'),

    /*
    |--------------------------------------------------------------------------
    | RabbitMQ Connections
    |--------------------------------------------------------------------------
    */

    'connections' => [
        'default' => [
            // Домен контейнера
            'host' => env('RABBITMQ_HOST'),
            // Порт RabbitMQ
            'port' => env('RABBITMQ_PORT'),
            // Логин
            'user' => env('RABBITMQ_USER'),
            // Пароль
            'password' => env('RABBITMQ_PASSWORD'),
            // Виртуальный хост
            'vhost' => env('RABBITMQ_VHOST'),
        ],

    ],
    /*
    |--------------------------------------------------------------------------
    | RabbitMQ queues
    |--------------------------------------------------------------------------
    */
    'queues' => [
        // Основная очередь
        'laravel_queue' => env('RABBITMQ_QUEUE', 'laravel_queue'),
    ],

    /*
    |--------------------------------------------------------------------------
    | RabbitMQ Exchanges
    |--------------------------------------------------------------------------
    */

    'exchanges' => [
        'default' => [
            'name' => 'laravel_exchange',
            'type' => 'direct',
            'passive' => false,
            'durable' => true,
            'auto_delete' => false,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Queue Options
    |--------------------------------------------------------------------------
    */

    'options' => [
        'queue' => [
            'passive' => false,
            'durable' => true,
            'exclusive' => false,
            'auto_delete' => false,
        ],
    ],

];
